Revit 2024 API
BuiltInFailures.StairRampFailures.StairsWinderGenLayoutFailure Property
 Fail to generate run layout and then cannot make winder run
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId StairsWinderGenLayoutFailure { get; }
Visual Basic
Public Shared ReadOnly Property StairsWinderGenLayoutFailure As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ StairsWinderGenLayoutFailure {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace